// 3  非递减有序数组a，编写一个算法，使得数组a中没有重复元素。
//             比如：int a[17] = { 1,2,2,2,4,5,5,8,8,8,8,9,10,12,15,19,19 };
//      输出      a ={1,2,4,5,8,9,10,12,15,19};
//    void  DeleteSame(int a[], int n，int &k)
//    说明：a[] 非递减数组， n   数组a长度，  k 处理后a的长度

void  DeleteSame(int a[], int n，int &k)
{  //遍历一次int a[17] = { 1,2,2,2,4,5,5,8,8,8,8,9,10,12,15,19,19 };
        int i=1;      
        k=0;     //定义一个指针k，记录当前不重复元素的下标
        while (i<n){
            if (a[i]!=a[k]){   
                k++;
                a[k]=a[i];
                }   //关键
                i++；
                }
        k++；//返回补充元素个数
}

//功能优化：数组无序的情况

